#include <iostream>

using namespace std;
 
int main()
{
    int n = 4, r = n-1;
    float A[n][n] = {{ 0, 1.5,   2,  3},
                     { 4,   5,   6,  7},
                     { 8,   9,  10, 11},
                     {12,  13, -14, 15}};
    
    float B[2*n-1];

    for(int column = 0; column < n; column++)              // проходжу 0-ий рядок масиву А
    {
        float sum = A[0][column];                          // надаю сумі значення елемента 0-ого рядка 
        for(int j = column - 1, i = 1; j >= 0; j--, i++)   // переходжу до елемента наступного рядка з номером на 1 меншим за даний
            sum += A[i][j];                                // до суми додаю цей елемент
        
        B[column] = sum;                                   // заношу значення суми в масив В
    }
    
    for(int line = 1; line < n; line++)                    // проходжу (n-1)-ий стовпчик масиву А
    {
        float sum = A[line][r];                            // надаю сумі значення елемента (n-1)-ого стовпчика
        for(int j = r - 1, i = line + 1; i < n; i++, j--)  // переходжу до елемента наступного рядка з номером на 1 меншим за даний
            sum += A[i][j];                                // до суми додаю цей елемент
        
		B[line + r] = sum;                                 // заношу значення суми в масив В
    }

	for(int i=0; i<2*n-1; i++)
	{
		cout << B[i] << "; ";
	}

    return 0;
}
